{"config": [{"config": {"batch_input_shape": [null, 64, 64, 1], "name": "conv2d_31", "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activation": "linear", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "filters": 64, "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_37", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "axis": -1, "epsilon": 0.001, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_37", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"use_bias": true, "name": "conv2d_32", "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "filters": 64, "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_38", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "axis": -1, "epsilon": 0.001, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_38", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_19", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_25", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "name": "conv2d_33", "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "filters": 64, "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_39", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "axis": -1, "epsilon": 0.001, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_39", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"use_bias": true, "name": "conv2d_34", "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "filters": 128, "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_40", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "axis": -1, "epsilon": 0.001, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_40", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_20", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_26", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "name": "conv2d_35", "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "filters": 128, "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_41", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "axis": -1, "epsilon": 0.001, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_41", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_21", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_27", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_7", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "name": "dense_13", "units": 512, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_42", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "axis": -1, "epsilon": 0.001, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_42", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_28", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "name": "dense_14", "units": 64, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6"}