{"config": [{"config": {"batch_input_shape": [null, 64, 64, 1], "name": "conv2d_41", "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activation": "linear", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "filters": 64, "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_49", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "axis": -1, "epsilon": 0.001, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_49", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"use_bias": true, "name": "conv2d_42", "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "filters": 64, "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_50", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "axis": -1, "epsilon": 0.001, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_50", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_25", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_33", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "name": "conv2d_43", "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "filters": 64, "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_51", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "axis": -1, "epsilon": 0.001, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_51", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"use_bias": true, "name": "conv2d_44", "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "filters": 128, "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_52", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "axis": -1, "epsilon": 0.001, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_52", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_26", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_34", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "name": "conv2d_45", "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "filters": 128, "kernel_regularizer": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_53", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "axis": -1, "epsilon": 0.001, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_53", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_27", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_35", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_9", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "name": "dense_17", "units": 512, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"gamma_constraint": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_54", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "scale": true, "axis": -1, "epsilon": 0.001, "trainable": true, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_54", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_36", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "name": "dense_18", "units": 3, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6"}